### Introduction To Pandas Module
Here, we are learning data analysis. Pandas is a software library written for the Python programming language that helps with data manipulation and analysis. It offers various data structures which help in the manipulation of data. <br>
One of the data structures used is DataFrame.<br>
DataFrame is used as a way to store data in a rectangular grid.<br>
Similar to how data is stored in Microsoft Excel.
### Installation
We can easily install this library using the terminal. Follow the steps given below to install Pandas:<br>
Step 1: Go to the Windows PowerShell.<br>
Step 2: We can install pandas with the help of pip easily. Head over to the directory where you want to install the pandas and fire the below command:<br>
__pip install pandas__<br>
This is very simple to install.

In [ ]:
# !pip install pandas

### Other way to install
If the above steps do not work for you, here is another way to install:<br>
Step 1: Go to your browser. Search for __python unofficial binaries__, or click <br>
https://www.lfd.uci.edu/~gohlke/pythonlibs/<br> 
and you will be redirected to the binary page.<br>
Step 2: To download the library, search for pandas â€“ Ctrl + F will help you. Download pandas library based on your python version. <br>
Step 3: After the installation, head over to the directory where you've downloaded the pandas. <br>
Step 4: Right-click to open Windows PowerShell. Pip can help us with the installation. Just go to that location in your terminal and run the following command: <br>
__pip install pandas__ <br>
Complete this command by the TAB button so that the location of your folder is mentioned.

### import pandas
Once Pandas is installed, import it in your applications by adding the import keyword:<br>
__import pandas as pd__<br>
Now Pandas is imported and ready to use.

In [1]:
import pandas

In [7]:
dict1 = {
    'Name': ["Anees Ahmad", "Ayan Alam", "Abid Khan", "Usama Khan","Qasim Shah"],
    'Marks': [80, 72, 77, 65, 15],
    'Class':["4th Year", "4th Year", "3rd Year", "3rd Year", "2nd Year"]
}

In [8]:
df = pandas.DataFrame(dict1)

In [10]:
df

          Name  Marks     Class
0  Anees Ahmad     80  4th Year
1    Ayan Alam     72  4th Year
2    Abid Khan     77  3rd Year
3   Usama Khan     65  3rd Year
4   Qasim Shah     15  2nd Year

### Pandas as pd
Pandas is usually imported under the pd alias.
#### alias: 
In Python alias are an alternate name for referring to the same thing.<br>
Create an alias with the as keyword while importing:<br>
__import pandas as pd__<br>
Now the Pandas package can be referred to as pd instead of pandas.

In [11]:
import pandas as pd

In [12]:
df = pd.DataFrame(dict1)

In [13]:
df

          Name  Marks     Class
0  Anees Ahmad     80  4th Year
1    Ayan Alam     72  4th Year
2    Abid Khan     77  3rd Year
3   Usama Khan     65  3rd Year
4   Qasim Shah     15  2nd Year

### Checking Pandas Version
The version string is stored under __version__ attribute.

In [14]:
pd.__version__

'2.2.3'

## Import to CSV

In [15]:
df.to_csv('3.2.csv')

## Remove Index

In [16]:
df.to_csv('3.2RemoveIndex.csv', index=False)

## Show some rows from the Start

In [17]:
df.head()

          Name  Marks     Class
0  Anees Ahmad     80  4th Year
1    Ayan Alam     72  4th Year
2    Abid Khan     77  3rd Year
3   Usama Khan     65  3rd Year
4   Qasim Shah     15  2nd Year

In [18]:
df.tail(3)

         Name  Marks     Class
2   Abid Khan     77  3rd Year
3  Usama Khan     65  3rd Year
4  Qasim Shah     15  2nd Year

In [19]:
df.tail()

          Name  Marks     Class
0  Anees Ahmad     80  4th Year
1    Ayan Alam     72  4th Year
2    Abid Khan     77  3rd Year
3   Usama Khan     65  3rd Year
4   Qasim Shah     15  2nd Year

In [20]:
df.describe()

           Marks
count   5.000000
mean   61.800000
std    26.771253
min    15.000000
25%    65.000000
50%    72.000000
75%    77.000000
max    80.000000

In [21]:
classData= pd.read_csv(r"C:\Users\swiss\Desktop\ML\3.2.csv")

In [22]:
classData

   Unnamed: 0         Name  Marks     Class
0           0  Anees Ahmad     80  4th Year
1           1    Ayan Alam     72  4th Year
2           2    Abid Khan     77  3rd Year
3           3   Usama Khan     65  3rd Year
4           4   Qasim Shah     15  2nd Year

In [23]:
classData.drop(0, axis=0)

   Unnamed: 0        Name  Marks     Class
1           1   Ayan Alam     72  4th Year
2           2   Abid Khan     77  3rd Year
3           3  Usama Khan     65  3rd Year
4           4  Qasim Shah     15  2nd Year

In [24]:
classData

   Unnamed: 0         Name  Marks     Class
0           0  Anees Ahmad     80  4th Year
1           1    Ayan Alam     72  4th Year
2           2    Abid Khan     77  3rd Year
3           3   Usama Khan     65  3rd Year
4           4   Qasim Shah     15  2nd Year

In [26]:
classData['Marks']

0    80
1    72
2    77
3    65
4    15
Name: Marks, dtype: int64

In [27]:
classData['Name']

0    Anees Ahmad
1      Ayan Alam
2      Abid Khan
3     Usama Khan
4     Qasim Shah
Name: Name, dtype: object

In [29]:
classData['Class']

0    4th Year
1    4th Year
2    3rd Year
3    3rd Year
4    2nd Year
Name: Class, dtype: object

In [30]:
type(classData['Name'])

pandas.core.series.Series

In [31]:
classData['Marks'][0]

np.int64(80)

In [32]:
classData['Marks'][0]=90

C:\Users\swiss\AppData\Local\Temp\ipykernel_5680\3766287785.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  classData['Marks'][0]=90

In [33]:
classData

   Unnamed: 0         Name  Marks     Class
0           0  Anees Ahmad     90  4th Year
1           1    Ayan Alam     72  4th Year
2           2    Abid Khan     77  3rd Year
3           3   Usama Khan     65  3rd Year
4           4   Qasim Shah     15  2nd Year

In [34]:
classData['Marks'][4]

np.int64(15)

In [35]:
classData['Marks'][4]=5

C:\Users\swiss\AppData\Local\Temp\ipykernel_5680\305642868.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  classData['Marks'][4]=5

In [36]:
classData["Class"][4]="Second Year"

C:\Users\swiss\AppData\Local\Temp\ipykernel_5680\3056981296.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  classData["Class"][4]="Second Year"

In [37]:
classData

   Unnamed: 0         Name  Marks        Class
0           0  Anees Ahmad     90     4th Year
1           1    Ayan Alam     72     4th Year
2           2    Abid Khan     77     3rd Year
3           3   Usama Khan     65     3rd Year
4           4   Qasim Shah      5  Second Year

In [39]:
classData["Name"][4]

'Qasim Shah'

In [40]:
classData

   Unnamed: 0         Name  Marks        Class
0           0  Anees Ahmad     90     4th Year
1           1    Ayan Alam     72     4th Year
2           2    Abid Khan     77     3rd Year
3           3   Usama Khan     65     3rd Year
4           4   Qasim Shah      5  Second Year

In [41]:
classData.to_csv('3.2New.csv')

In [42]:
classData.to_csv('3.2NewRemoveIndex.csv', index=False)

## Create Labels
With the index argument, you can name your own labels.

In [43]:
classData.index = ["First","Second", "Third", "Fourth", "Fifth"]

In [44]:
classData

        Unnamed: 0         Name  Marks        Class
First            0  Anees Ahmad     90     4th Year
Second           1    Ayan Alam     72     4th Year
Third            2    Abid Khan     77     3rd Year
Fourth           3   Usama Khan     65     3rd Year
Fifth            4   Qasim Shah      5  Second Year

In [45]:
classData["Name"]["Fifth"]

'Qasim Shah'

## Pandas 
Pandas is an open source data analysis library written in Python.<br>
It uses the power and speed of numpy to make data analysis and preprocessing easy for data scientists.<br>
__Pandas__ is used to analyze data.<br>
Python data analysis using pandas is a great start to Exploratory Data Analysis (EDA) for a data scientist.

## Pandas Data Structure
Panda has two types of Data Structure:<br> 
    a) Series<br>
    b) Dataframe
### Series
It is a one dimentional array with indexes. It stores a single column or row of data in a Dataframe.<br>
It is a one dimensional array capable of holding any type of data.
### Dataframe
It is a tabular spreadsheet like structure representing rows each of which contains one or more columns.<br>
It is a multi dimensional array capable of holding any type of data.<br>
__Series__ is like a column, a __DataFrame__ is the whole table.

In [46]:
classData['Marks']

First     90
Second    72
Third     77
Fourth    65
Fifth      5
Name: Marks, dtype: int64

In [47]:
type(classData['Marks'])

pandas.core.series.Series

In [48]:
classData

        Unnamed: 0         Name  Marks        Class
First            0  Anees Ahmad     90     4th Year
Second           1    Ayan Alam     72     4th Year
Third            2    Abid Khan     77     3rd Year
Fourth           3   Usama Khan     65     3rd Year
Fifth            4   Qasim Shah      5  Second Year

In [49]:
type(classData)

pandas.core.frame.DataFrame

In [50]:
import numpy as np

In [51]:
series1= pd.Series(np.random.rand())

In [52]:
series1

0    0.628757
dtype: float64

In [53]:
series1= pd.Series(np.random.rand(30))

In [54]:
series1

0     0.409131
1     0.398762
2     0.123538
3     0.115565
4     0.097431
5     0.148935
6     0.478136
7     0.602219
8     0.446609
9     0.061353
10    0.180414
11    0.348278
12    0.520938
13    0.398247
14    0.945391
15    0.504382
16    0.923536
17    0.619412
18    0.939505
19    0.618949
20    0.702216
21    0.021782
22    0.350064
23    0.732798
24    0.820468
25    0.193747
26    0.654436
27    0.683328
28    0.790655
29    0.704789
dtype: float64

In [55]:
type(series1)

pandas.core.series.Series

In [56]:
newDf = pd.DataFrame(np.random.rand(330,5))
# newDf = pd.DataFrame(np.random.rand(330,5), index=np.arange(330))

In [57]:
type(newDf)

pandas.core.frame.DataFrame

In [58]:
newDf

            0         1         2         3         4
0    0.416113  0.207910  0.164216  0.525284  0.768124
1    0.383548  0.168433  0.187929  0.613764  0.904613
2    0.257243  0.712012  0.088637  0.116315  0.298110
3    0.466084  0.323729  0.351574  0.456606  0.776034
4    0.467989  0.821382  0.451938  0.351626  0.534904
..        ...       ...       ...       ...       ...
325  0.008772  0.059339  0.890778  0.699782  0.620969
326  0.920939  0.138594  0.511774  0.324026  0.346258
327  0.863215  0.125109  0.604982  0.110215  0.794862
328  0.616395  0.529457  0.084746  0.024979  0.110618
329  0.100672  0.315478  0.895678  0.639590  0.903344

[330 rows x 5 columns]

In [59]:
newDf.head(2)

          0         1         2         3         4
0  0.416113  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613

In [60]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [61]:
newDf.tail(2)

            0         1         2         3         4
328  0.616395  0.529457  0.084746  0.024979  0.110618
329  0.100672  0.315478  0.895678  0.639590  0.903344

In [62]:
newDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330 entries, 0 to 329
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       330 non-null    float64
 1   1       330 non-null    float64
 2   2       330 non-null    float64
 3   3       330 non-null    float64
 4   4       330 non-null    float64
dtypes: float64(5)
memory usage: 13.0 KB

In [63]:
newDf.describe()

                0           1           2           3           4
count  330.000000  330.000000  330.000000  330.000000  330.000000
mean     0.499478    0.500667    0.496181    0.507516    0.484668
std      0.274520    0.294078    0.297368    0.294017    0.288240
min      0.001344    0.000414    0.001824    0.001258    0.000034
25%      0.289671    0.233124    0.221504    0.264879    0.238501
50%      0.508599    0.514419    0.494559    0.492676    0.509984
75%      0.711688    0.781960    0.775098    0.761938    0.726106
max      0.997549    0.996220    0.993320    0.999782    0.997420

In [64]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [65]:
newDf[0][0]= "Maaz Khan"

C:\Users\swiss\AppData\Local\Temp\ipykernel_5680\4095004716.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newDf[0][0]= "Maaz Khan"
C:\Users\swiss\AppData\Local\Temp\ipykernel_5680\4095004716.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Maaz Khan' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newDf[0][0]= "Maaz Khan"

In [66]:
newDf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [67]:
newDf

             0         1         2         3         4
0    Maaz Khan  0.207910  0.164216  0.525284  0.768124
1     0.383548  0.168433  0.187929  0.613764  0.904613
2     0.257243  0.712012  0.088637  0.116315  0.298110
3     0.466084  0.323729  0.351574  0.456606  0.776034
4     0.467989  0.821382  0.451938  0.351626  0.534904
..         ...       ...       ...       ...       ...
325   0.008772  0.059339  0.890778  0.699782  0.620969
326   0.920939  0.138594  0.511774  0.324026  0.346258
327   0.863215  0.125109  0.604982  0.110215  0.794862
328   0.616395  0.529457  0.084746  0.024979  0.110618
329   0.100672  0.315478  0.895678  0.639590  0.903344

[330 rows x 5 columns]

In [68]:
newDf.index

RangeIndex(start=0, stop=330, step=1)

In [69]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [70]:
newDf.to_numpy()

array([['Maaz Khan', 0.20790969099142276, 0.1642158621341845,
        0.5252837849625631, 0.7681241920125469],
       [0.3835481246107899, 0.16843292915159158, 0.1879290151826306,
        0.6137638529091572, 0.904612859028157],
       [0.257243470554547, 0.7120117934267048, 0.08863704055191413,
        0.11631484527081648, 0.2981095842210938],
       ...,
       [0.8632150163653489, 0.125108547897684, 0.6049820511368761,
        0.11021520670094742, 0.7948621564759553],
       [0.6163946832978433, 0.5294567866154891, 0.08474639004709905,
        0.024979394734548466, 0.11061819101236625],
       [0.10067201885985255, 0.31547792256587215, 0.8956784942221794,
        0.6395902152237299, 0.9033435189830274]], dtype=object)

In [71]:
newDf[0][0]=0.30

In [72]:
newDf.head()

          0         1         2         3         4
0       0.3  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613
2  0.257243  0.712012  0.088637  0.116315  0.298110
3  0.466084  0.323729  0.351574  0.456606  0.776034
4  0.467989  0.821382  0.451938  0.351626  0.534904

In [73]:
newDf.T

,0,1,2,3,4,5,6,7,8,9,...,320,321,322,323,324,325,326,327,328,329
0,0.3,0.383548,0.257243,0.466084,0.467989,0.545981,0.636379,0.859874,0.570144,0.543629,...,0.3002,0.394731,0.309194,0.17423,0.946632,0.008772,0.920939,0.863215,0.616395,0.100672
1,0.20791,0.168433,0.712012,0.323729,0.821382,0.342554,0.303175,0.801797,0.300642,0.711413,...,0.741938,0.134927,0.946611,0.546898,0.75591,0.059339,0.138594,0.125109,0.529457,0.315478
2,0.164216,0.187929,0.088637,0.351574,0.451938,0.709027,0.126545,0.060175,0.151497,0.913891,...,0.874529,0.943799,0.324221,0.171286,0.25228,0.890778,0.511774,0.604982,0.084746,0.895678
3,0.525284,0.613764,0.116315,0.456606,0.351626,0.160186,0.139598,0.758994,0.738735,0.177827,...,0.339621,0.944898,0.484923,0.973286,0.999782,0.699782,0.324026,0.110215,0.024979,0.63959
4,0.768124,0.904613,0.29811,0.776034,0.534904,0.468512,0.307593,0.17587,0.697985,0.682285,...,0.375189,0.188409,0.02614,0.552411,0.495656,0.620969,0.346258,0.794862,0.110618,0.903344

In [74]:
newDf.sort_index(axis=0)

            0         1         2         3         4
0         0.3  0.207910  0.164216  0.525284  0.768124
1    0.383548  0.168433  0.187929  0.613764  0.904613
2    0.257243  0.712012  0.088637  0.116315  0.298110
3    0.466084  0.323729  0.351574  0.456606  0.776034
4    0.467989  0.821382  0.451938  0.351626  0.534904
..        ...       ...       ...       ...       ...
325  0.008772  0.059339  0.890778  0.699782  0.620969
326  0.920939  0.138594  0.511774  0.324026  0.346258
327  0.863215  0.125109  0.604982  0.110215  0.794862
328  0.616395  0.529457  0.084746  0.024979  0.110618
329  0.100672  0.315478  0.895678  0.639590  0.903344

[330 rows x 5 columns]

In [75]:
newDf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
329  0.100672  0.315478  0.895678  0.639590  0.903344
328  0.616395  0.529457  0.084746  0.024979  0.110618
327  0.863215  0.125109  0.604982  0.110215  0.794862
326  0.920939  0.138594  0.511774  0.324026  0.346258
325  0.008772  0.059339  0.890778  0.699782  0.620969
..        ...       ...       ...       ...       ...
4    0.467989  0.821382  0.451938  0.351626  0.534904
3    0.466084  0.323729  0.351574  0.456606  0.776034
2    0.257243  0.712012  0.088637  0.116315  0.298110
1    0.383548  0.168433  0.187929  0.613764  0.904613
0         0.3  0.207910  0.164216  0.525284  0.768124

[330 rows x 5 columns]

In [76]:
newDf.sort_index(axis=1)

            0         1         2         3         4
0         0.3  0.207910  0.164216  0.525284  0.768124
1    0.383548  0.168433  0.187929  0.613764  0.904613
2    0.257243  0.712012  0.088637  0.116315  0.298110
3    0.466084  0.323729  0.351574  0.456606  0.776034
4    0.467989  0.821382  0.451938  0.351626  0.534904
..        ...       ...       ...       ...       ...
325  0.008772  0.059339  0.890778  0.699782  0.620969
326  0.920939  0.138594  0.511774  0.324026  0.346258
327  0.863215  0.125109  0.604982  0.110215  0.794862
328  0.616395  0.529457  0.084746  0.024979  0.110618
329  0.100672  0.315478  0.895678  0.639590  0.903344

[330 rows x 5 columns]

In [77]:
newDf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.768124  0.525284  0.164216  0.207910       0.3
1    0.904613  0.613764  0.187929  0.168433  0.383548
2    0.298110  0.116315  0.088637  0.712012  0.257243
3    0.776034  0.456606  0.351574  0.323729  0.466084
4    0.534904  0.351626  0.451938  0.821382  0.467989
..        ...       ...       ...       ...       ...
325  0.620969  0.699782  0.890778  0.059339  0.008772
326  0.346258  0.324026  0.511774  0.138594  0.920939
327  0.794862  0.110215  0.604982  0.125109  0.863215
328  0.110618  0.024979  0.084746  0.529457  0.616395
329  0.903344  0.639590  0.895678  0.315478  0.100672

[330 rows x 5 columns]

In [78]:
newDf.head()

          0         1         2         3         4
0       0.3  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613
2  0.257243  0.712012  0.088637  0.116315  0.298110
3  0.466084  0.323729  0.351574  0.456606  0.776034
4  0.467989  0.821382  0.451938  0.351626  0.534904

In [79]:
newDf[0][1]

0.3835481246107899

In [80]:
type(newDf[0])

pandas.core.series.Series

In [81]:
newDf

            0         1         2         3         4
0         0.3  0.207910  0.164216  0.525284  0.768124
1    0.383548  0.168433  0.187929  0.613764  0.904613
2    0.257243  0.712012  0.088637  0.116315  0.298110
3    0.466084  0.323729  0.351574  0.456606  0.776034
4    0.467989  0.821382  0.451938  0.351626  0.534904
..        ...       ...       ...       ...       ...
325  0.008772  0.059339  0.890778  0.699782  0.620969
326  0.920939  0.138594  0.511774  0.324026  0.346258
327  0.863215  0.125109  0.604982  0.110215  0.794862
328  0.616395  0.529457  0.084746  0.024979  0.110618
329  0.100672  0.315478  0.895678  0.639590  0.903344

[330 rows x 5 columns]

## view

In [82]:
newDfView=newDf

In [83]:
newDfView

            0         1         2         3         4
0         0.3  0.207910  0.164216  0.525284  0.768124
1    0.383548  0.168433  0.187929  0.613764  0.904613
2    0.257243  0.712012  0.088637  0.116315  0.298110
3    0.466084  0.323729  0.351574  0.456606  0.776034
4    0.467989  0.821382  0.451938  0.351626  0.534904
..        ...       ...       ...       ...       ...
325  0.008772  0.059339  0.890778  0.699782  0.620969
326  0.920939  0.138594  0.511774  0.324026  0.346258
327  0.863215  0.125109  0.604982  0.110215  0.794862
328  0.616395  0.529457  0.084746  0.024979  0.110618
329  0.100672  0.315478  0.895678  0.639590  0.903344

[330 rows x 5 columns]

In [84]:
newDfView[0][0]=765

C:\Users\swiss\AppData\Local\Temp\ipykernel_5680\4063526219.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newDfView[0][0]=765
C:\Users\swiss\AppData\Local\Temp\ipykernel_5680\4063526219.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newDfView[0][0]=765

In [85]:
newDf.head()

          0         1         2         3         4
0       765  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613
2  0.257243  0.712012  0.088637  0.116315  0.298110
3  0.466084  0.323729  0.351574  0.456606  0.776034
4  0.467989  0.821382  0.451938  0.351626  0.534904

In [86]:
newDfView.head()

          0         1         2         3         4
0       765  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613
2  0.257243  0.712012  0.088637  0.116315  0.298110
3  0.466084  0.323729  0.351574  0.456606  0.776034
4  0.467989  0.821382  0.451938  0.351626  0.534904

In [87]:
newDfCopy=newDf.copy()

In [88]:
newDfCopy[0][0]=656

C:\Users\swiss\AppData\Local\Temp\ipykernel_5680\2532441962.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newDfCopy[0][0]=656
C:\Users\swiss\AppData\Local\Temp\ipykernel_5680\2532441962.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newDfCopy[0][0]=656

In [89]:
newDf.head()

          0         1         2         3         4
0       765  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613
2  0.257243  0.712012  0.088637  0.116315  0.298110
3  0.466084  0.323729  0.351574  0.456606  0.776034
4  0.467989  0.821382  0.451938  0.351626  0.534904

In [90]:
newDfCopy.head()

          0         1         2         3         4
0       656  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613
2  0.257243  0.712012  0.088637  0.116315  0.298110
3  0.466084  0.323729  0.351574  0.456606  0.776034
4  0.467989  0.821382  0.451938  0.351626  0.534904

## loc

In [91]:
newDf.head(2)

          0         1         2         3         4
0       765  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613

In [92]:
newDf.loc[0,0]

765

In [93]:
newDf.loc[0,0]=5678

In [94]:
newDf.head(2)

          0         1         2         3         4
0      5678  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613

In [95]:
newDf.loc[0,4]

np.float64(0.7681241920125469)

In [96]:
newDf.loc[325,1]

np.float64(0.05933886007960465)

In [97]:
newDf.loc[0,0]=9875

In [98]:
newDf.head(2)

          0         1         2         3         4
0      9875  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613

In [99]:
newDf.columns=list("ABCDE")

In [100]:
newDf.head(3)

          A         B         C         D         E
0      9875  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613
2  0.257243  0.712012  0.088637  0.116315  0.298110

In [101]:
newDf.loc[0, "A"]

9875

In [102]:
newDf.loc[0,"A"]=65

In [103]:
newDf.head(3)

          A         B         C         D         E
0        65  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613
2  0.257243  0.712012  0.088637  0.116315  0.298110

In [104]:
newDf.loc[35,"A"]

0.32214759964349227

In [105]:
newDf.drop(0, axis=0).head(3)

          A         B         C         D         E
1  0.383548  0.168433  0.187929  0.613764  0.904613
2  0.257243  0.712012  0.088637  0.116315  0.298110
3  0.466084  0.323729  0.351574  0.456606  0.776034

In [106]:
newDf.drop("A", axis=1).head(3)

          B         C         D         E
0  0.207910  0.164216  0.525284  0.768124
1  0.168433  0.187929  0.613764  0.904613
2  0.712012  0.088637  0.116315  0.298110

In [107]:
newDf.head(3)

          A         B         C         D         E
0        65  0.207910  0.164216  0.525284  0.768124
1  0.383548  0.168433  0.187929  0.613764  0.904613
2  0.257243  0.712012  0.088637  0.116315  0.298110

In [108]:
newDf = newDf.drop("A", axis=1)

In [109]:
newDf.head(3)

          B         C         D         E
0  0.207910  0.164216  0.525284  0.768124
1  0.168433  0.187929  0.613764  0.904613
2  0.712012  0.088637  0.116315  0.298110

In [110]:
newDf.loc[[1,2],["C","D"]]

          C         D
1  0.187929  0.613764
2  0.088637  0.116315

In [111]:
newDf.head(3)

          B         C         D         E
0  0.207910  0.164216  0.525284  0.768124
1  0.168433  0.187929  0.613764  0.904613
2  0.712012  0.088637  0.116315  0.298110

In [112]:
newDf.loc[:,["C","D"]]

            C         D
0    0.164216  0.525284
1    0.187929  0.613764
2    0.088637  0.116315
3    0.351574  0.456606
4    0.451938  0.351626
..        ...       ...
325  0.890778  0.699782
326  0.511774  0.324026
327  0.604982  0.110215
328  0.084746  0.024979
329  0.895678  0.639590

[330 rows x 2 columns]

In [113]:
newDf.loc[[1,2],:]

          B         C         D         E
1  0.168433  0.187929  0.613764  0.904613
2  0.712012  0.088637  0.116315  0.298110

In [114]:
newDf.loc[:5,["C","D"]]

          C         D
0  0.164216  0.525284
1  0.187929  0.613764
2  0.088637  0.116315
3  0.351574  0.456606
4  0.451938  0.351626
5  0.709027  0.160186

In [115]:
newDf.loc[[1,2],:"D"]

          B         C         D
1  0.168433  0.187929  0.613764
2  0.712012  0.088637  0.116315

In [116]:
newDf.loc[(newDf["B"]<0.3)]

            B         C         D         E
0    0.207910  0.164216  0.525284  0.768124
1    0.168433  0.187929  0.613764  0.904613
14   0.150547  0.585167  0.556624  0.554513
16   0.189116  0.009838  0.489246  0.704820
17   0.011874  0.700029  0.079509  0.748722
..        ...       ...       ...       ...
319  0.094443  0.789406  0.740047  0.334593
321  0.134927  0.943799  0.944898  0.188409
325  0.059339  0.890778  0.699782  0.620969
326  0.138594  0.511774  0.324026  0.346258
327  0.125109  0.604982  0.110215  0.794862

[102 rows x 4 columns]

In [117]:
newDf.loc[(newDf["B"]<0.3) & (newDf["D"]>0.2)]

            B         C         D         E
0    0.207910  0.164216  0.525284  0.768124
1    0.168433  0.187929  0.613764  0.904613
14   0.150547  0.585167  0.556624  0.554513
16   0.189116  0.009838  0.489246  0.704820
21   0.241007  0.059917  0.852624  0.904780
..        ...       ...       ...       ...
317  0.139290  0.455397  0.806489  0.292461
319  0.094443  0.789406  0.740047  0.334593
321  0.134927  0.943799  0.944898  0.188409
325  0.059339  0.890778  0.699782  0.620969
326  0.138594  0.511774  0.324026  0.346258

[81 rows x 4 columns]

In [118]:
newDf.head(3)

          B         C         D         E
0  0.207910  0.164216  0.525284  0.768124
1  0.168433  0.187929  0.613764  0.904613
2  0.712012  0.088637  0.116315  0.298110

## iloc

In [119]:
newDf.iloc[0,0]

np.float64(0.20790969099142276)

In [120]:
newDf.iloc[0,0]=555

In [121]:
newDf.head()

            B         C         D         E
0  555.000000  0.164216  0.525284  0.768124
1    0.168433  0.187929  0.613764  0.904613
2    0.712012  0.088637  0.116315  0.298110
3    0.323729  0.351574  0.456606  0.776034
4    0.821382  0.451938  0.351626  0.534904

In [122]:
newDf.iloc[[0,4],[1,3]]

          C         E
0  0.164216  0.768124
4  0.451938  0.534904

In [123]:
newDf.head(4)

            B         C         D         E
0  555.000000  0.164216  0.525284  0.768124
1    0.168433  0.187929  0.613764  0.904613
2    0.712012  0.088637  0.116315  0.298110
3    0.323729  0.351574  0.456606  0.776034

In [124]:
newDf.drop(0).head()

          B         C         D         E
1  0.168433  0.187929  0.613764  0.904613
2  0.712012  0.088637  0.116315  0.298110
3  0.323729  0.351574  0.456606  0.776034
4  0.821382  0.451938  0.351626  0.534904
5  0.342554  0.709027  0.160186  0.468512

In [125]:
# newDf.drop(0, axis=1)

In [126]:
# newDf.drop("B", axis=1).head()

In [127]:
newDf.drop(["C", "D"], axis=1).head()

            B         E
0  555.000000  0.768124
1    0.168433  0.904613
2    0.712012  0.298110
3    0.323729  0.776034
4    0.821382  0.534904

In [128]:
newDf.head()

            B         C         D         E
0  555.000000  0.164216  0.525284  0.768124
1    0.168433  0.187929  0.613764  0.904613
2    0.712012  0.088637  0.116315  0.298110
3    0.323729  0.351574  0.456606  0.776034
4    0.821382  0.451938  0.351626  0.534904

In [129]:
newDf.drop(['B', 'D'], axis=1, inplace=True)

In [130]:
newDf.head()

          C         E
0  0.164216  0.768124
1  0.187929  0.904613
2  0.088637  0.298110
3  0.351574  0.776034
4  0.451938  0.534904

In [131]:
newDf.reset_index().head()

   index         C         E
0      0  0.164216  0.768124
1      1  0.187929  0.904613
2      2  0.088637  0.298110
3      3  0.351574  0.776034
4      4  0.451938  0.534904

In [132]:
newDf.reset_index(drop=True).head()

          C         E
0  0.164216  0.768124
1  0.187929  0.904613
2  0.088637  0.298110
3  0.351574  0.776034
4  0.451938  0.534904

In [133]:
newDf.head()

          C         E
0  0.164216  0.768124
1  0.187929  0.904613
2  0.088637  0.298110
3  0.351574  0.776034
4  0.451938  0.534904

In [134]:
newDf.reset_index(drop=True, inplace=True)

In [135]:
newDf.head()

          C         E
0  0.164216  0.768124
1  0.187929  0.904613
2  0.088637  0.298110
3  0.351574  0.776034
4  0.451938  0.534904

# Groupby
The groupby method allows you to group rows of data together and call aggregate functions

â€‹
â€‹

In [136]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [137]:
df = pd.DataFrame(data)

In [138]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

### Now you can use the .groupby() method to group rows together based off of a column name.
For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [139]:
df.groupby('Company')

##### You can save this object as a new variable:

In [140]:
by_comp = df.groupby("Company")
type(by_comp)

pandas.core.groupby.generic.DataFrameGroupBy

#### And then call aggregate methods of the object:

In [142]:
by_comp.mean("Company")

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [144]:
df.groupby('Company').mean("Company")

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [149]:
by_comp.min("Company")

         Sales
Company
FB         243
GOOG       120
MSFT       124

In [150]:
by_comp.max("Company")

         Sales
Company
FB         350
GOOG       200
MSFT       340

In [153]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [152]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0